In [1]:
import pandas as pd

In [2]:
str1 = 'string'
type(str1)

str

In [3]:
num1 = 132
type(num1)

int

In [15]:
num2 = 0.322351
type(num2)

float

In [5]:
list1 = [1, 2, 3, 4, 5]
type(list1)

list

In [6]:
list2 = [2.3, 15, 'string', [23, 15]]
type(list2)

list

In [16]:
list3 = [1, 1, 1, 1, 1, 3]

In [17]:
set2 = set(list3)
set2

{1, 3}

In [18]:
list4 = ['sam', 'sam', 'sam', 'david']
list4

['sam', 'sam', 'sam', 'david']

In [19]:
set3 = set(list4)
set3

{'david', 'sam'}

In [26]:
dict2 = {'a':1, 'b':2, 'c':3, 'd':4}
dict2

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [27]:
dict2['a']

1

In [28]:
data = {'name': ['Tom', 'Sam', 'David', 'Kathy']
        , 'phone': ['iOS', 'android', 'android', 'iOS']
        , 'gender': ['m', 'f', 'm', 'f']
        , 'monthly_cost': [21.99, 32.98, 19.99, 35.99]
       }

In [29]:
df = pd.DataFrame(data)
df

    name    phone gender  monthly_cost
0    Tom      iOS      m         21.99
1    Sam  android      f         32.98
2  David  android      m         19.99
3  Kathy      iOS      f         35.99

In [31]:
game_df = pd.read_csv('./data/GamingStudy_data.csv')
game_df.sample(5)

,S. No.,Timestamp,GAD1,GAD2,GAD3,GAD4,GAD5,GAD6,GAD7,GADE,...,Birthplace,Residence,Reference,Playstyle,accept,GAD_T,SWL_T,SPIN_T,Residence_ISO3,Birthplace_ISO3
6812,7174,42054.80301,3,3,3,3,2,2,3,Very difficult,...,USA,USA,Reddit,Multiplayer - online - with online acquaintanc...,Accept,19,9,35.0,USA,USA
8481,8942,42054.85084,1,0,1,0,0,2,0,Somewhat difficult,...,USA,USA,Reddit,Multiplayer - online - with strangers,Accept,4,22,19.0,USA,USA
6966,7336,42054.80641,1,2,2,0,1,0,0,Somewhat difficult,...,USA,USA,Reddit,Multiplayer - online - with real life friends,Accept,6,12,11.0,USA,USA
10435,11023,42054.95176,1,1,1,2,0,1,0,Somewhat difficult,...,USA,USA,Reddit,Multiplayer - online - with strangers,Accept,6,6,37.0,USA,USA
12668,13409,42055.20806,0,0,0,0,0,2,0,Not difficult at all,...,Singapore,UK,Reddit,Multiplayer - online - with strangers,Accept,2,24,7.0,GBR,SGP

In [13]:
raw_data = {'employee_name': ['Andy', 'Beth', 'Cindy', "Dale"],
            'employee_id': [123456,789456,654123,963852],
            'date_joined': ['2015-02-15', np.nan, '2017-05-16', "2018-01-15"],
            'age': [45,36,34,25],
            'yrs_of_experience': [24,14,14,4]}
df = pd.DataFrame(raw_data, columns = ['employee_name', 'employee_id', 'date_joined','age', 'yrs_of_experience'])
df

NameError: name 'np' is not defined